{
  "data": [
    {
      "title": "Angular Countdown Timer",
      "imgUrl": "../../assets/projects-grid/angular-countdown-timer.jpg",
      "description": "Angular countdown timer component with very minimal code. Plug it into any Angular project. Easily customize style or add milliseconds. Great feature to use in advertisements.",
      "path": "/ui-components/angular-countdown-timer",
      "altText": "Angular countdown timer component. Countdown with days, hours, minutes, and seconds. Written in TypeScript.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "APOD NASA Gov",
      "imgUrl": "../../assets/projects-grid/apod-nasa-gov.jpg",
      "description": "APOD NASA Gov is NASA's Photo of the Day API. This Angular app w/ numerous components pings the endpoint to populate the DOM. A service connects them all. Access records dating back to 1995.",
      "path": "/web-development-projects/apod-nasa-gov",
      "altText": "APOD NASA Gov API. Single page app w/ numerous components using the endpoint to populate the DOM. Access records dating back to 1995",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "REST Countries",
      "imgUrl": "../../assets/projects-grid/rest-countries.jpg",
      "description": "REST Countries app coupled w/ Leafleft interactive maps wrapped in an Angular UI experience. Pulling data in from a remote source and using it to plot locations on a map. Flexible UI.",
      "path": "/web-development-projects/rest-countries",
      "altText": "REST Countries app coupled w/ Leafleft interactive maps. Pulls data in from an OMDB API and uses it to plot locations on a map.",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "React Project",
      "imgUrl": "../../assets/projects-grid/react-project.jpg",
      "description": "Basic get data sample React project written. Retrieves data from the Hackernews API then distributes the output to multiple components. Obtain new results by searching the endpoint for relative queries.",
      "path": "https://stackblitz.com/edit/react-http-get?file=Content.tsx",
      "altText": "React project using the Hackernews API as a data feed. Multiple components, clearly showing data distribution and styling.",
      "stackblitz": true,
      "internal": null,
      "category": "projects"
    },
    {
      "title": "OMDB API — Movie & TV Search",
      "imgUrl": "../../assets/projects-grid/omdb-api.jpg",
      "description": "This app uses output from the OMDB API. It's packaged up in a neat UI. Fully responsive and written in TypeScript. Enter a TV show or movie EXACTLY and get tremendous data in return. Look up your favorite movies/tv shows.",
      "path": "/web-development-projects/omdb-api",
      "altText": "Movie app using the OMDB API as a data source. Search for cinema or TV titles. Results populate table rows or showcase movie posters.",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "Angular Date Picker",
      "imgUrl": "../../assets/projects-grid/angular-date-picker.jpg",
      "description": "I've never cared for Angular Material, so I created my own Angular date picker. No complex configurations or modular additions. Just add the component and you're up and running.",
      "path": "/ui-components/angular-date-picker",
      "altText": "Angular date picker component that'll easily fit into any project by exporting the date value. Closes on external clicks.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Angular Accordion",
      "imgUrl": "../../assets/projects-grid/accordion-component.jpg",
      "description": "Angular accordion component to neatly organize data in to sections. Use it in a column or as body content. The choice is yours. Comes with two different layouts, but easily add more.",
      "path": "/ui-components/accordion-component",
      "altText": "Angular accordion component. Store information in colapasable units. Built with three layouts, but add as many as you'd like.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Angular Dynamic Sidebar",
      "imgUrl": "../../assets/projects-grid/angular-dynamic-sidebar.jpg",
      "description": "I recently had to create an Angular dynamic sidebar with user permissions. Users only had access to pages provided in the endpoints output. This is a close representation of my creation minus the permissions.",
      "path": "/ui-components/angular-dynamic-sidebar",
      "altText": "Angular dynamic sidebar. Specify which section is a drop down menu, and populate all menu items via a DB/API.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Angular Data Table",
      "imgUrl": "../../assets/projects-grid/angular-data-table.jpg",
      "description": "Angular data table importing JSON. Search, filter, and pagination; set item count per page. Easily modify height, width, colors, etc. Replace dummy data stream with your own, customize style, etc.",
      "path": "/ui-components/angular-data-table",
      "altText": "Paginated Angular data table importing JSON data. Easily customize height and width, colors, etc.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Table in HTML",
      "imgUrl": "../../assets/projects-grid/table-in-html.jpg",
      "description": "For those of you working on a framework agnostic project, here's an HTML table written entirely in HTML, JavaScript, & CSS. Features include JSON data import, sort columns, search, and pagination.",
      "path": "/ui-components/table-in-html",
      "altText": "Table in HTML with search and sort functionality. Written in vanilla JavaScript.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Chart JS Area Chart",
      "imgUrl": "../../assets/projects-grid/chart-js-area-chart.jpg",
      "description": "Chart JS area chart showcasing how easy it is to import data via JSON. Easily change colors, X or Y axis options, labels. Fork and make it your own.",
      "path": "https://stackblitz.com/edit/angular-8-area-chart?file=src%2Fapp%2Fapp.component.ts",
      "altText": "Chart JS area chart with not much styling. Project shows how to easily use dynamic data streams.",
      "stackblitz": true,
      "internal": null,
      "category": "components"
    },
    {
      "title": "Chart JS Multiple Lines",
      "imgUrl": "../../assets/projects-grid/chart-js-multiple-lines.jpg",
      "description": "Chart JS multiple lines written in TypeScript. Change an abundance of options in one TS object. Plug it into any Angular App (lower than 14 I believe). Angular 14 and up seems to require Chart JS V3.",
      "path": "https://stackblitz.com/edit/chartjs-multi-line-chart?file=src%2Fapp%2Fapp.component.ts",
      "altText": "Chart JS multiple line chart. Data visualization by means of two lines spread out over multiple values.",
      "stackblitz": true,
      "internal": null,
      "category": "components"
    },
    {
      "title": "Chart JS Bar Chart UI",
      "imgUrl": "../../assets/projects-grid/chart-js-bar-chart.jpg",
      "description": "Neat little Chart JS bar chart UI I created to familiarize myself moreso with components, the library, and using streams of JSON data. Pick it apart, fork, download....use for your purposes.",
      "path": "https://stackblitz.com/edit/chartjs-bar-chart?file=src%2Fapp%2Fapp.component.ts",
      "altText": "Chart JS bar chart user interface. Click on quarter 1, 2, or 3 and watch the data visualization bars change values.",
      "stackblitz": true,
      "internal": null,
      "category": "components"
    },
    {
      "title": "Chart JS Doughnut Chart",
      "imgUrl": "../../assets/projects-grid/chart-js-doughnut.jpg",
      "description": "Chart JS doughnut chart components working together to make up a neat little UI. Easily plug this into a financial app to display customer/client data. Ideal for data visualization enthusiasts.",
      "path": "https://stackblitz.com/edit/doughnut-chart-component?file=src%2Fapp%2Fdoughnut-chart%2Fdoughnut-chart.component.ts",
      "altText": "Three dhart JS doughnut charts. Intended to showcase analytics. Use all three or just one. Demo of reusable code.",
      "stackblitz": true,
      "internal": null,
      "category": "components"
    },
    {
      "title": "Chart JS Line Chart",
      "imgUrl": "../../assets/projects-grid/chart-js-line-chart.jpg",
      "description": "When the designer creates a mock, it's up to the developer to build it. This was my first attempt at modifying a Chart JS line chart to suit drastically different needs than it's default.",
      "path": "https://stackblitz.com/edit/chart-with-js?file=src%2Fapp%2Fline-chart%2Fline-chart.component.ts",
      "altText": "Custom chart JS line chart with an options menu. Hide/show labels on X or Y axis, or hide the grid alltogether.",
      "stackblitz": true,
      "internal": null,
      "category": "components"
    },
    {
      "title": "D3 Bar Chart",
      "imgUrl": "../../assets/projects-grid/d3-bar-chart.jpg",
      "description": "D3 bar chart with a script to get you going. A brief intro to the world of D3. Modifications may be required to make it work in a framework. Written in vanilla JavaScript.",
      "path": "/ui-components/d3-bar-chart",
      "altText": "Responsive D3 bar chart with an X and Y axis. Project includes both the HTML and JavaScript.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Website Examples",
      "imgUrl": "../../assets/projects-grid/website-examples.jpg",
      "description": "Two fully responsive website examples I recently created. One developed in pure HTML, CSS, & JavaScript, but functions like a single page app. 100% on a Google Speed test at deployment. The other, a massive financial single page app.",
      "path": "/web-development-projects/website-examples",
      "altText": "Two fully responsive website examples. Each of which showcase single page app architectures. One in native HTML, the other in TypeScript.",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "React To Do List",
      "imgUrl": "../../assets/projects-grid/react-to-do-list.jpg",
      "description": "React app demostrating basic features, functionality, and components. Running in Stackblitz, so check out live code, modify, fork...",
      "path": "https://stackblitz.com/edit/react-list-item-app?file=src%2Fcomponents%2FTodoitem.js",
      "altText": "React app to do list. Add and subtract things you'd like to do. Easily plug them into a DB or use for practice.",
      "stackblitz": true,
      "internal": null,
      "category": "projects"
    },
    {
      "title": "Weather-Leaflet App",
      "imgUrl": "../../assets/projects-grid/weather-app.jpg",
      "description": "TypeScript app retrieving data from a weather API. It then plots locations on a Leaflet map. Goal was to connect two APIs and have them play nicely together. Adding 3-7-10 day results is a breeze.",
      "path": "https://stackblitz.com/edit/angular-weather-component?file=src%2Fapp%2Fapp.component.ts",
      "altText": "Weather API communicating with the Leaflet maps API. Together they construct a modern weather forecast showing locations on a map.",
      "stackblitz": true,
      "internal": null,
      "category": "projects"
    },
    {
      "title": "AngularJS Project",
      "imgUrl": "../../assets/projects-grid/angularjs-project.jpg",
      "description": "Though I built this circa 2017, I still love it. This AngularJS project uses nearly all the bells and whistles of the former framework. Components, templates, controllers, page transitions, APIs, nested JSON powered image galleries, factories, etc.",
      "path": "/web-development-projects/angularjs-project",
      "altText": "AngularJS project using all the bells and whistles of the framework. Controllers, factories, templates, transitions, and more.",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "Modules in Angular",
      "imgUrl": "../../assets/projects-grid/modules-in-angular.jpg",
      "description": "Modules in Angular are the backbone of the framework. See modular code navigation and learn how to properly maintain modules in a large production ready application.",
      "path": "/web-application-development/modules-in-angular/home",
      "altText": "Showcasing modules in Angular. How to use them and navigate between them.",
      "stackblitz": false,
      "internal": true,
      "category": "development"
    },
    {
      "title": "JavaScript Drag and Drop",
      "imgUrl": "../../assets/projects-grid/javascript-drag-and-drop.jpg",
      "description": "I was recently tasked w/ the challenge of creating a JavaScript drag and drop UI. It called for the ability to drag multiple elements, each w/ their own POST requests. I wanted to ensure it went smooth, so I developed this similar concept.",
      "path": "/web-development-projects/javascript-drag-and-drop",
      "altText": "JavaScript drag and drop is a common task and this app showcases it via a simple UI. Drag/drop elements or create new ones.",
      "stackblitz": false,
      "internal": true,
      "category": "projects"
    },
    {
      "title": "Angular Event Emitter",
      "imgUrl": "../../assets/projects-grid/angular-event-emitter.jpg",
      "description": "Angular event emitter illustrated via three components. Interact with a data table component and send the click event to the parent. Then share that same click event with a Chart JS area chart. Great example of one of the many ways to share data,",
      "path": "https://stackblitz.com/edit/angular-eventemitter-example",
      "altText": "Angular event emitter showcased between an area chart and table. Click table rows and watch the area chart reflect the table values.",
      "stackblitz": true,
      "internal": null,
      "category": "development"
    },
    {
      "title": "In Page Navigation",
      "imgUrl": "../../assets/projects-grid/in-page-navigation.jpg",
      "description": "Basic in page navigation mock. Easily show and hide different sections of a page without changing pages. Ideal for a questionaire, quiz, or any type of user info gathering UI.",
      "path": "/web-application-development/in-page-navigation",
      "altText": "In page navigation with a progress bar at the bottom. Navigate to different sections without changing pages.",
      "stackblitz": false,
      "internal": true,
      "category": "development"
    },
    {
      "title": "Angular Slider",
      "imgUrl": "../../assets/projects-grid/angular-slider.jpg",
      "description": "Basic Angular slider. Replace the JSON to suit your own needs. Take this foundation and add transitions or textual descriptions. Tinker with it here or in Stackblitz.",
      "path": "/ui-components/angular-slider",
      "altText": "Angular slider w/ clickable dots. Click a dot to shift the slider to a new book or change book w/ next/prev buttons.",
      "stackblitz": false,
      "internal": true,
      "category": "components"
    },
    {
      "title": "Angular Resolver",
      "imgUrl": "../../assets/projects-grid/angular-resolver.jpg",
      "description": "Angular resolver that preloads component content. This sample however takes it one step further by disallowing an endpoint to be called more than once. Ideal if you have a prefix appended to multiple endpoints.",
      "path": "https://stackblitz.com/edit/angular-resolver-mock?file=src%2Fapp%2Fresolver.service.ts",
      "altText": "Angular resolver that not only pre fetches content, but all ensures the endpoint is called only once.",
      "stackblitz": true,
      "internal": null,
      "category": "development"
    }
  ]
}
